cask '1password'
brew 'adr-tools'
cask 'alfred'
brew 'ansible'
brew 'argocd'
brew 'asdf'

brew 'bash-completion'
cask 'chromium'
brew 'commitizen'
brew 'coreutils'
brew 'curl'
cask 'firefox'
brew 'ffmpeg'
brew 'fprobe'

cask 'xbar'

# cloud
## AWS
brew 'awscli'

## GCP 
cask 'google-cloud-sdk'

#git
brew 'git'
cask 'gitkraken'
brew 'gh'

#go
brew 'golang'
brew 'go-task'

brew 'graphviz'

brew 'htop'
brew 'hugo'
cask 'iterm2'
brew 'jenv'
brew 'jq'

#rdbms
cask 'pgadmin4'
cask 'datasette'

#k8s

brew 'colima'
brew 'helm'
brew 'k9s'
brew 'kubectl'
brew 'kubectx'
brew 'kustomize'
brew 'krew'

# cask 'rancher'
brew 'clusterctl'

brew 'temporal'

brew 'mas'
brew 'mkdocs'
brew 'pass'

# api
cask 'postman'
cask 'postman-cli'

#python
brew 'pyenv'
brew 'python3'
brew 'ipython'

#other
cask 'slack'
cask 'snagit'
cask 'steam'

#terraform
brew 'terraform-docs'
brew 'tfenv'

brew 'trash'
brew 'tree'
brew 'telnet'
brew 'vim'
cask 'visual-studio-code'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'yt-dlp'

#zsh
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-fast-syntax-highlighting"

# mas installs
mas 'Todoist', id: 585829637
mas 'Magnet', id: 441258766
mas '1Password for Safari', id: 1569813296
mas 'Notability', id: 360593530
mas 'iStat Menus', id: 1319778037
# max 'Xcode', id: 497799835


# cisco
cask 'webex'
tap 'ats-operations/homebrew-tap', 'https://wwwin-github.cisco.com/ATS-operations/homebrew-tap'
brew 'vault'